export const navData = () => {
  return [
    {
      name: "เดินทางดี",
      substrategies: [
        "เดินได้ เดินดี",
        "เพิ่มความคล่องตัวการเดินทาง",
        "ส่งเสริมการใช้ระบบขนส่งสาธารณะและเพิ่มทางเลือกในการเดินทาง",
        "ป้องกันและแก้ปัญหาน้ำท่วม",
      ],
    },
    {
      name: "ปลอดภัยดี",
      substrategies: [
        "แก้ไขจุดเสี่ยงภัยและอาชญากรรม",
        "เพิ่มทรัพยากร ทักษะ และข้อมูลความปลอดภัยชุมชน",
        "สร้างระบบเครือข่ายในพื้นที่จัดการสาธารณภัย",
      ],
    },
    {
      name: "โปร่งใสดี",
      substrategies: [
        "รายงานปัญหาโดยประชาชน แก้ปัญหาโดย กทม. ผ่านแพลตฟอร์ม Traffy Fondue",
        "เผยแพร่ข้อมูล เปิดเผยการจัดซื้อจัดจ้าง ขออนุญาตบริการออนไลน์ (Open Bangkok)",
        "ยกระดับความร่วมมือในการต่อต้านการทุจริตกับองค์กรที่เกี่ยวข้อง",
      ],
    },
    {
      name: "สิ่งแวดล้อมดี",
      substrategies: ["เพิ่มพื้นที่สีเขียว ต้นไม้", "จัดการขยะ อากาศ น้ำเสีย"],
    },
    {
      name: "สุขภาพดี",
      substrategies: [
        "สนับสนุนและพัฒนากิจกรรมส่งเสริมสุขภาพชุมชนทุกกลุ่ม",
        "ยกระดับระบบสุขภาพปฐมภูมิและเครือข่ายสาธารณสุข",
        "เพิ่มประสิทธิภาพการเข้าถึงการรักษาพยาบาล ที่เชื่อมโยงไร้รอยต่อ",
        "พัฒนานวัตกรรมการรักษาพยาบาล",
      ],
    },
    {
      name: "เรียนดี",
      substrategies: [
        "ส่งเสริมการเรียนรู้ เด็กเล็กก่อนวัยเรียน (2-6 ปี)",
        "พัฒนาสวัสดิการครูและนักเรียน",
        "Transform หลักสูตรและห้องเรียนดิจิทัล",
      ],
    },
    {
      name: "เศรษฐกิจดี",
      substrategies: [
        "เพิ่มโอกาสตลาดแรงงาน ฝึกอาชีพคนเมือง",
        "เพิ่มพื้นที่ Hawker Center ตลาดค้าขาย",
        "ส่งเสริมเศรษฐกิจสร้างสรรค์ (Soft Power) และเศรษฐกิจระดับย่าน",
        "ปักหมุดสร้างเมืองดึงดูดการลงทุนระดับโลก",
      ],
    },

    {
      name: "สังคมดี",
      substrategies: [
        "เปิดพื้นที่สาธารณะเพื่อรองรับกิจกรรมที่หลากหลาย",
        "สนับสนุนเงื่อนไขการดำรงชีพคนไร้บ้าน คนพิการ และกลุ่มเปราะบาง",
        "สร้างชุมชนเข้มแข็งร่วมพัฒนา",
      ],
    },

    {
      name: "บริหารจัดการดี",
      substrategies: [
        "ระบบงาน เงิน คน ระเบียบที่มีประสิทธิภาพ",
        "ส่งเสริมการมีส่วนร่วมของประชาชนในการร่วมบริหารจัดการเมือง",
      ],
    },
    {
      name: "ไม่พบข้อมูล",
      substrategies: ["ไม่พบข้อมูล"],
    },
  ];
};
