export const navData = () => {
  return [
    {
      name: "เดินทางดี",
      substrategies: [
        "ปลอดอาชญากรรมและยาเสพติด",
        "ปลอดอุบัติเหตุ",
        "ปลอดภัยพิบัติ",
        "ปลอดอุบัติภัยจากสิ่งก่อสร้าง",
        "เมืองสุขภาพดี",
      ],
    },
    {
      name: "สิ่งแวดล้อมดี",
      substrategies: [
        "คุณภาพสิ่งแวดล้อมยั่งยืน",
        "พื้นที่สีเขียวเพื่อสุขภาวะที่ดีและมีความยั่งยืนด้านสิ่งแวดล้อมตามมาตรฐานสากล",
        "สังคมคาร์บอนต่ำและการรับมือต่อการเปลี่ยนแปลงสภาพ",
        "เมืองที่ใช้พลังงานอย่างมีประสิทธิภาพสูงและเป็นมิตรต่อสิ่งแวดล้อม",
      ],
    },
    {
      name: "เศรษฐกิจดี",
      substrategies: [
        "ผู้สูงอายุ คนพิการ และผู้ด้อยโอกาสได้รับการดูแลอย่างครบวงจร",
        "เมืองแห่งโอกาสทางสังคม",
        "การศึกษาสำหรับทุกคน",
        "สังคมพหุวัฒนธรรม",
      ],
    },
    {
      name: "ปลอดภัยดี",
      substrategies: [
        "เมืองเติบโตอย่างมีระเบียบ ใช้ประโยชน์ที่ดินและทรัพยากรอย่างมีประสิทธิภาพ",
        "มีศูนย์ชุมชนย่อย (Sub Center) เพิ่มศักยภาพพื้นที่เป็นโครงข่ายเชื่อมโยงกันอย่างมีระบบ",
        "การจัดการภูมิทัศน์เมืองอย่างยั่งยืน",
        "ระบบขนส่งมวลชนทั่วถึง สะดวก ประหยัด การจราจรคล่องตัวและมีทางเลือก",
      ],
    },
    {
      name: "สุขภาพดี",
      substrategies: [
        "มหานครกรุงเทพแบบบูรณาการ",
        "พลเมืองขับเคลื่อนมหานคร",
        "การกระจายอำนาจ",
        "เมืองสีขาว",
      ],
    },
    {
      name: "สังคมดี",
      substrategies: [
        "เมืองแห่งโอกาสทางธุรกิจและการลงทุน",
        "กรุงเทพมหานครเป็นเมืองที่น่าท่องเที่ยวระดับโลก",
        "เมืองแห่งการจัดประชุมนิทรรศการ",
      ],
    },
    {
      name: "โปร่งใสดี",
      substrategies: [
        "กฎหมาย",
        "การบริหารแผนและประเมินผล",
        "การบริหารทรัพยากรบุคคล",
        "การคลังและงบประมาณ",
        "เทคโนโลยีสารสนเทศ",
      ],
    },
    {
      name: "เรียนดี",
      substrategies: [],
    },
    {
      name: "บริหารจัดการดี",
      substrategies: [],
    },
  ];
};
