export interface Strategy {
  sub_strategy: string;
  sub_srategy_def: string[];
}

export interface Plan {
  strategy: string;
  img?: string;
  strategies?: Strategy[];
  color?: string;
}

export const planData: Plan[] = [
  {
    strategy: "เดินทางดี",
    img: "strategy_1",
    color: "strategy-1",
    strategies: [
      {
        sub_strategy: "เดินได้ เดินดี",
        sub_srategy_def: [
          "ประชาชนสามารถเดินทางสัญจรด้วยการเดินเท้า ทางจักรยาน หรือวีลแชร์บนทางเท้าด้วยความสะดวก คล่องตัวและปลอดภัย",
        ],
      },
      {
        sub_strategy: "เพิ่มความคล่องตัวการเดินทาง",
        sub_srategy_def: [
          "ประชาชนใช้เวลาบนถนนเพื่อการเดินทางลดลง สามารถเดินทางไปถึงจุดหมายได้เร็วขึ้น",
        ],
      },
      {
        sub_strategy:
          "ส่งเสริมการใช้ระบบขนส่งสาธารณะและเพิ่มทางเลือกในการเดินทาง",
        sub_srategy_def: [
          "ประชาชนสามารถเข้าถึงระบบขนส่งสาธารณะทุกประเภทได้อย่างสะดวกสบายในทุกพื้นที่ และสามารถเดินทางจากสถานีขนส่งมวลชนไปสู่จุดหมายปลายทาง (Last mile) ได้อย่างสะดวกรวดเร็ว",
        ],
      },
      {
        sub_strategy: "ป้องกันและแก้ปัญหาน้ำท่วม",
        sub_srategy_def: [
          "ลดผลกระทบจากน้ำท่วมขังในเส้นทางสัญจรและการดำเนินชีวิตของประชาชน",
        ],
      },
    ],
  },
  {
    strategy: "ปลอดภัยดี",
    img: "strategy_2",
    color: "strategy-2",
    strategies: [
      {
        sub_strategy: "แก้ไขจุดเสี่ยงภัยและอาชญากรรม",
        sub_srategy_def: [
          "ประชาชนเข้าถึงความปลอดภัยได้ดียิ่งขึ้น เข้าถึงข้อมูลเกี่ยวกับความเสี่ยงทุกรูปแบบ",
        ],
      },
      {
        sub_strategy: "เพิ่มทรัพยากร ทักษะ และข้อมูลความปลอดภัยชุมชน",
        sub_srategy_def: [
          "ลดและแก้ไขปรับปรุงสภาพแวดล้อมที่ทำให้เกิดความกลัวและความเสี่ยงอาชญากรรม",
          "เพิ่มประสิทธิภาพในการคาดการณ์ ติดตาม และแก้ไขหรือระงับการเกิดเหตุอาชญากรรม",
          "ลดความเสียหายและความสูญเสียให้กับประชาชน ได้ทักษะและรู้ขั้นตอนการปฏิบัติตัวเมื่อเกิดสาธารณภัย ได้เตรียมความพร้อมรับมือล่วงหน้าเพื่อลดผลกระทบจากการเกิดสาธารณภัย",
        ],
      },
      {
        sub_strategy: "สร้างระบบเครือข่ายในพื้นที่จัดการสาธารณภัย",
        sub_srategy_def: [
          "ลดความเสียหายและความสูญเสียให้กับประชาชน",
          "ได้ทักษะและรู้ขั้นตอนการปฏิบัติตัวเมื่อเกิดสาธารณภัย",
        ],
      },
    ],
  },
  {
    strategy: "โปร่งใสดี",
    img: "strategy_3",
    color: "strategy-3",
    strategies: [
      {
        sub_strategy:
          "รายงานปัญหาโดยประชาชน แก้ปัญหาโดย กทม. ผ่านแพลตฟอร์ม Traffy Fondue",
        sub_srategy_def: ["ได้รับการแก้ไขปัญหาด้วยความรวดเร็วและมีประสิทธิภาพ"],
      },
      {
        sub_strategy:
          "เผยแพร่ข้อมูล เปิดเผยการจัดซื้อจัดจ้าง ขออนุญาตบริการออนไลน์ (Open Bangkok)",
        sub_srategy_def: [
          "กรุงเทพมหานครเป็นมหานครเปิด (Open Government) ด้วยการเปิดเผยข้อมูล เปิดโอกาสให้ประชาชนมีส่วนร่วมและสามารถตรวจสอบการทำงาน เพื่อป้องกันการทุจริตคอร์รัปชันและสร้างมหานครที่เป็นของ 'ทุกคน'",
        ],
      },
      {
        sub_strategy:
          "ยกระดับความร่วมมือในการต่อต้านการทุจริตกับองค์กรที่เกี่ยวข้อง",
        sub_srategy_def: [
          "ความโปร่งใส เช่น การขอใบอนุมัติ อนุญาตใบรับรองต่าง ๆ ไม่มีการร้องขอเงิน หรือเรียกรับผลประโยชน์ ความโปร่งใสของโครงการสาธารณะขนาดใหญ่ การใช้งบประมาณและการจัดซื้อจัดจ้างมีความโปร่งใส เปิดเผย ตรวจสอบได้",
        ],
      },
    ],
  },
  {
    strategy: "สิ่งแวดล้อมดี",
    img: "strategy_4",
    color: "strategy-4",
    strategies: [
      {
        sub_strategy: "เพิ่มพื้นที่สีเขียว ต้นไม้",
        sub_srategy_def: [
          "ได้พื้นที่สีเขียวร่มเงาในเมืองและกำแพงกรองฝุ่น ได้พื้นที่สาธารณะที่ท้ากิจกรรมได้กระจายตัวอยู่ทุกที่และสามารถเข้าถึงได้ด้วยการเดินภายใน 15 นาที",
        ],
      },
      {
        sub_strategy: "จัดการขยะ อากาศ น้ำเสีย",
        sub_srategy_def: [
          "สภาพแวดล้อมเมืองสะอาด สวยงาม การคัดแยกและการจัดเก็บขยะท้าได้สะดวกรวดเร็ว ไม่มีขยะตกค้าง และไม่มีแหล่งเพาะเชื้อโรคหรือพาหะที่ส่งผลต่อสุขภาพคนเมือง",
          "แหล่งน้ำสาธารณะของกรุงเทพมหานคร สะอาด ปลอดภัย คุณภาพน้ำได้มาตรฐานตามเกณฑ์ที่กำหนด",
          "แหล่งกำเนิดมลพิษทางอากาศได้รับการควบคุม เพื่อให้คุณภาพอากาศอยู่ในเกณฑ์มาตรฐาน",
          "เมืองมีแผนรองรับเพื่อลดผลกระทบจากการปล่อยก๊าซเรือนกระจกและการเปลี่ยนแปลงสภาพภูมิอากาศ",
        ],
      },
    ],
  },
  {
    strategy: "สุขภาพดี",
    img: "strategy_5",
    color: "strategy-5",
    strategies: [
      {
        sub_strategy: "สนับสนุนและพัฒนากิจกรรมส่งเสริมสุขภาพชุมชนทุกกลุ่ม",
        sub_srategy_def: [
          "สนับสนุนและพัฒนากิจกรรมส่งเสริมสุขภาพชุมชนทุกกลุ่ม ยกระดับระบบสุขภาพปฐมภูมิและเครือข่ายสาธารณสุข เพิ่มประสิทธิภาพการเข้าถึง การรักษาพยาบาลที่เชื่อมโยงไร้รอยต่อ พัฒนานวัตกรรมการรักษาพยาบาล",
          "ประชาชนได้รับการคัดกรองป้องกันและรักษาโรคอย่างมีประสิทิธิภาพ สามารถเข้าถึงกองทุนหลักประกันสุขภาพกรุงเทพมหานคร (สปสช.) เพื่อมีส่วนร่วมในการสร้างเสริมสุขภาพชุมชนภายใต้สภาพแวดล้อมที่ดีของเมือง",
        ],
      },
      {
        sub_strategy: "ยกระดับระบบสุขภาพปฐมภูมิและเครือข่ายสาธารณสุข",
        sub_srategy_def: [
          "ประชาชนได้รับการวินิจฉัยโรคด้วยแพทยเ์ฉพาะทางผ่านสถานพยาบาลใกล้บ้าน ที่มีประสิทธิภาพและได้รับบริการแพทย์ฉุกเฉินที่มีประสิทธภาพและรวดเร็ว",
        ],
      },
      {
        sub_strategy:
          "เพิ่มประสิทธิภาพการเข้าถึงการรักษาพยาบาลที่เชื่อมโยงไร้รอยต่อ",
        sub_srategy_def: [
          "เพิ่มสัดส่วนการเข้ารับบริการตรวจรักษา/พบแพทย์ ด้วยระบบโทรเวชกรรม Telemedicine",
          "ผู้ป่วยต้องได้รับการดูแลรักษาและส่งต่อ อย่างมีประสิทธิภาพ",
          "มีการเชื่อมโยงข้อมูลในระบบ Bangkok Health Zoning",
        ],
      },
      {
        sub_strategy: "พัฒนานวัตกรรมการรักษาพยาบาล",
        sub_srategy_def: [
          "ประชาชนไดร้บัการบรกิารด้านสาธารณสุขทั้งในระดับปฐมภูมิละทุติยภมูิ จากแพทย์ผู้เชี่ยวชาญด้วยนวัตกรรมที่จะช่วยส่งเสริมสุขภาพที่ดีและป้องกันการสูญเสียรุนแรงในชีวิต",
        ],
      },
    ],
  },
  {
    strategy: "เรียนดี",
    img: "strategy_6",
    color: "strategy-6",
    strategies: [
      {
        sub_strategy: "ส่งเสริมการเรียนรู้ เด็กเล็กก่อนวัยเรียน (2-6 ปี)",
        sub_srategy_def: [
          "เด็กในพืนที่ กทม. ได้รับการส่งเสริมพัฒนาการการเรียนรู้สมวัยจากโรงเรียน/ ศูนย์พัฒนาเด็กเล็กที่มีมาตรฐาน (เด็กในโรงเรียนสังกัดกรุงเทพมหานครและในศูนย์พัฒนาเด็กเล็กผ่านเกณฑ์การประเมิน DSPM 100%)",
        ],
      },
      {
        sub_strategy: "พัฒนาสวัสดิการครูและนักเรียน",
        sub_srategy_def: [
          "ครูในกรุงเทพมหานครทำงานอย่างมีความสุข เพื่อให้สามารถจัดการเรียนการสอนได้อย่างมีประสิทธิภาพ ",
        ],
      },
      {
        sub_strategy: "Transform หลักสูตรและห้องเรียนดิจิทัล",
        sub_srategy_def: [
          "นักเรียนในโรงเรียนสังกัดกรุงเทพมหานครได้รับการจัดการเรียนรู้รูปแบบใหม่ที่สอดคล้องกับบริบทของโรงเรียนและตรงตามความสนใจของตนเองอย่างมีคุณภาพตามมาตรฐานของกรุงเทพมหานคร",
        ],
      },
    ],
  },
  {
    strategy: "เศรษฐกิจดี",
    img: "strategy_7",
    color: "strategy-7",
    strategies: [
      {
        sub_strategy: "เพิ่มโอกาสตลาดแรงงาน ฝึกอาชีพคนเมือง",
        sub_srategy_def: [
          "ส่งเสริมให้ประชาชนได้มีงานทำหรือมีทักษะในการนำไปประกอบธุรกิจ และผู้ประกอบการรายย่อยได้เข้าถึงระบบจัดซื้อจัดจ้าง",
        ],
      },
      {
        sub_strategy: "เพิ่มพื้นที่ Hawker Center ตลาดค้าขาย",
        sub_srategy_def: [
          "พืนที่การค้าสำหรับหาบเร่ที่มีการจัดการอย่างเป็นระบบ ไม่กีดขวางการสัญจร ผู้ค้าหาบเร่เข้าถึงพื้นที่ที่มีการบริหารจัดการที่มั่นคง มีส่วนร่วมในการกำหนดรูปแบบของการทำพื้นที่การค้าขายหาบเร่ในเขตที่อยู่อาศัยและใช้ชีวิต",
        ],
      },
      {
        sub_strategy:
          "ส่งเสริมเศรษฐกิจสร้างสรรค์ (Soft Power) และเศรษฐกิจระดับย่าน",
        sub_srategy_def: [
          "สร้างรายได้ให้กับผู้ประกอบการและประชาชนจากการจัดกิจกรรม",
        ],
      },
      {
        sub_strategy: "ปักหมุดสร้างเมืองดึงดูดการลงทุนระดับโลก",
        sub_srategy_def: [
          "อำนวยความสะดวกและให้บริการข้อมูลกับนักลงทุน และพนักงานทั้งชาวไทยและชาวต่างชาติในการด้าเนินธุรกิจและการใช้ชีวิตในกรุงเทพมหานคร",
        ],
      },
    ],
  },
  {
    strategy: "สังคมดี",
    img: "strategy_8",
    color: "strategy-8",
    strategies: [
      {
        sub_strategy: "เปิดพื้นที่สาธารณะเพื่อรองรับกิจกรรมที่หลากหลาย",
        sub_srategy_def: [
          "ได้พื้นที่สาธารณะที่กระจายตัวอยู่ทุกที่โดยประชาชนสามารถเข้าร่วมหรือประกอบกิจกรรมได้อย่างหลากหลายด้วยการเดินทางเข้าถึงได้ภายใน 15 นาที",
          "กรุงเทพมหานครเป็นพื้นที่ที่สามารถดำรงไว้ ซึ่งวัฒนธรรมที่สร้างความภาคภูมิใจและพัฒนาคุณภาพชีวิตที่ดีให้กับคนกรุงเทพมหานครได้",
        ],
      },
      {
        sub_strategy:
          "สนับสนุนเงื่อนไขการดำรงชีพคนไร้บ้าน คนพิการ และกลุ่มเปราะบาง",
        sub_srategy_def: [
          "กลุ่มเปราะบางได้รับการส่งเสริมสิทธิและบริการที่กรุงเทพมหานครจัดสรรให้ เช่น รถรับส่งคนพิการ รถเข็นสำหรับคนพิการและผู้สูงอายุ เป็นต้น",
        ],
      },
      {
        sub_strategy: "สร้างชุมชนเข้มแข็งร่วมพัฒนา",
        sub_srategy_def: [
          "มีโครงการพัฒนาชุมชนที่เสริมสร้างความเข้มแข็งได้อย่างยั่งยืน มีการดำเนินงานอย่างต่อเนื่อง",
          "ได้ข้อมูลเพื่อจัดสวัสดิการ และให้คนในชุมชนเข้าถึงความช่วยเหลือและบริการจากกรุงเทพมหานคร",
        ],
      },
    ],
  },
  {
    strategy: "บริหารจัดการดี",
    img: "strategy_9",
    color: "strategy-9",
    strategies: [
      {
        sub_strategy: "ระบบงาน เงิน คน ระเบียบที่มีประสิทธิภาพ",
        sub_srategy_def: [
          "ประชาชนได้รับผลประโยชน์สูงสุดจากการจัดสรรงบประมาณที่มีประสิทธิภาพ",
          "กรุงเทพมหานครมีการยกระดับศักยภาพในการจัดการเมืองให้สามารถให้บริการประชาชนและบริหารจัดการงานเมืองได้อย่างมีประสิทธิภาพ สะดวกรวดเร็วโปร่งใส มีความพร้อมและเอื้อต่อการสร้างโอกาสทางสังคม เศรษฐกิจ คุณภาพชีวิตของประชาชน",
          "การให้บริการของกรุงเทพมหานครมีความสะดวกรวดเร็ว มีการบริการอย่างเท่าเทียม มีช่องรับฟังคำติชมในด้านบริการและรับแจ้งเรื่องร้องเรียนต่างๆ ผ่านระบบออนไลน์ เพื่อความสะดวกรวดเร็วมากขึ้น",
          "กรุงเทพมหานครมีการบริหารทรัพยากรบุคคลที่เหมาะสม และมีระบบการบริหารและพัฒนาทรัพยากรบุคคลที่มีประสิทธิภาพ ส่งผลให้บุคลากรมีความเป็นมืออาชีพในการปฏิบัติงาน",
        ],
      },
      {
        sub_strategy:
          "ส่งเสริมการมีส่วนร่วมของประชาชนในการร่วมบริหารจัดการเมือง",
        sub_srategy_def: [
          "ประชาชนมีส่วนร่วมในการขับเคลื่อนและพัฒนาเมือง และสามารถตรวจสอบการทำงานของกรุงเทพมหานคร",
          "กรุงเทพมหานครเป็นมหานครที่บริหารจัดการแบบร่วมมือกัน (COLLABORATIVE GOVERNANCE) เพื่อสร้างความร่วมมือในการทำงานของทุกภาคส่วน และเปิดโอกาสให้ 'ทุกคน' เข้ามามีส่วนร่วมกับการพัฒนาเมือง",
        ],
      },
    ],
  },
  {
    strategy: "ไม่พบข้อมูล",
  },
];
