export const surveyData = () => [
  {
    no: 1,
    problem: "การเดินทางและการสัญจร",
    plan: "เดินทางดี",
    subProblem: [
      {
        no: 1,
        strategy:
          "การก่อสร้าง/ปรับปรุง ทางเดิน-ทางเท้า-ผิวจราจร-ทางจักรยาน-สะพานข้ามแยก",
      },
      {
        no: 2,
        strategy: "ป้องกันการขับขี่บนทางเท้า",
      },
      {
        no: 3,
        strategy: "ติดตั้งกล้อง CCTV-ป้าย-ไฟฟ้าส่องสว่าง",
      },
      {
        no: 4,
        strategy: "เพิ่มจุดเชื่อมต่อการเดินทาง-BMA Feeder-รถไฟฟ้า",
      },
      {
        no: 5,
        strategy: "ปรับปรุง/ซ่อมแซมระบบระบายน้ำ ท่อระบายน้ำ",
      },
    ],
  },
  {
    no: 2,
    problem: "อาชญากรรม ระบบจัดการสาธารณภัย",
    plan: "ปลอดภัยดี",
    subProblem: [
      {
        no: 1,
        strategy: "เพิ่ม/ติดตั้งกล้อง CCTV-ป้าย-ไฟฟ้าส่องสว่าง",
      },
      {
        no: 2,
        strategy: "เพิ่มเครือข่ายป้องกันสาธารณภัย สถานีดับเพลิง-อาสาป้องกันภัย",
      },
    ],
  },

  {
    no: 3,
    problem: "ความโปร่งใส ไร้การทุจริตในองค์กร",
    plan: "โปร่งใสดี",
    subProblem: [
      { no: 1, strategy: "พัฒนาศักยภาพของ Traffy Fondue" },
      { no: 2, strategy: "พัฒนาการให้บริการประชาชน สะดวกสบาย ถูกต้อง รวดเร็ว" },
      {
        no: 3,
        strategy:
          "ยกระดับสร้างความร่วมมือต่อต้านการทุจริตของภาครัฐและองค์กรที่เกี่ยวข้อง",
      },
    ],
  },

  {
    no: 4,
    problem: "สิ่งแวดล้อม อากาศ ",
    plan: "สิ่งแวดล้อมดี",
    subProblem: [
      {
        no: 1,
        strategy: "เพิ่มพื้นที่สีเขียว",
      },
      {
        no: 2,
        strategy: "ก่อสร้าง/ปรับปรุงสวนสาธารณะ",
      },
      {
        no: 3,
        strategy: "จัดการขยะมูลฝอย สิ่งปฏิกูล บำบัดน้ำเสีย ",
      },
      {
        no: 4,
        strategy: "ลดฝุ่น PM 2.5",
      },
    ],
  },

  {
    no: 5,
    problem: "สุขภาพ สาธารณสุข",
    plan: "สุขภาพดี",
    subProblem: [
      {
        no: 1,
        strategy: "ยกระดับโรงพยาบาล ศูนย์บริการสาธารณสุข",
      },
      {
        no: 2,
        strategy: "การเชื่อมโยงการรับ-ส่งผู้ป่วยระหว่างกัน",
      },
      {
        no: 3,
        strategy: "ป้องกันปัญหายาเสพติด โรคติดต่อ",
      },
      {
        no: 4,
        strategy: "สร้างระบบแพทย์ฉุกเฉิน แพทย์ทางไกล",
      },
      {
        no: 5,
        strategy: "ทำหมันสัตว์ ปัญหาสัตว์จรจัด ป้องกันพิษสุนัขบ้า",
      },
      {
        no: 6,
        strategy: "ดูแลทันตกรรมชุมชน ผู้สูงอายุ ศูนย์เด็กอ่อน-เด็กเล็ก",
      },
    ],
  },

  {
    no: 6,
    problem: "การศึกษาในกรุงเทพมหานคร",
    plan: "เรียนดี",
    subProblem: [
      {
        no: 1,
        strategy: "พัฒนาเด็กปฐมวัย-เด็กเล็กก่อนวัยเรียน",
      },
      {
        no: 2,
        strategy: "พัฒนาการศึกษาแก่ผู้พิการ-ผู้ด้อยโอกาส",
      },
      {
        no: 3,
        strategy: "ให้ทุนการศึกษา/คอมพิวเตอร์และสื่อการสอน",
      },
      {
        no: 4,
        strategy: "ส่งเสริมความรู้ด้านเทคโนโลยี ",
      },
      {
        no: 5,
        strategy: "โรงเรียนสองภาษา-ภาษาต่างประเทศ",
      },
      {
        no: 6,
        strategy: "ห้องสมุดออนไลน์",
      },
      {
        no: 7,
        strategy: "เสริมสร้างทักษะ/ฝึกอาชีพในโรงเรียน",
      },
    ],
  },

  {
    no: 7,
    problem: "เศรษฐกิจ",
    plan: "เศรษฐกิจดี",
    subProblem: [
      {
        no: 1,
        strategy: "เพิ่มการจ้างงานแก่ผู้ประกอบการรายย่อย",
      },
      {
        no: 2,
        strategy: "เพิ่มพื้นที่ตลาดออนไลน์ ส่งเสริมเศรษฐกิจ ",
      },
      {
        no: 3,
        strategy: "จัดตลาดท่องเที่ยว เทศกาล งาน Event",
      },
      {
        no: 4,
        strategy: "จัดระเบียบหาบเร่-แผงลอย",
      },
      {
        no: 5,
        strategy: "พัฒนาโรงเรียนฝึกอาชีพ",
      },
    ],
  },

  {
    no: 8,
    problem: "สังคม และชุมชนเข้มแข็ง",
    plan: "สังคมดี",
    subProblem: [
      {
        no: 1,
        strategy: "ก่อสร้าง/ปรับปรุงพัฒนา ศูนย์กีฬาและนันทนาการ",
      },
      {
        no: 2,
        strategy: "ส่งเสริมกิจกรรมชุมชน เพิ่มพื้นที่ลานกิจกรรม-พื้นที่สาธารณะ",
      },
      {
        no: 3,
        strategy: "ดูแลกลุ่มเปราะบาง-คนเร่ร่อน หาที่อยู่อาศัย ",
      },
      {
        no: 4,
        strategy: "ศูนย์บริการผู้พิการ",
      },
      {
        no: 5,
        strategy: "สร้างชุมชนเข้มแข็ง มีอาสาพัฒนาชุมชน",
      },
    ],
  },

  {
    no: 9,
    problem: "การบริหารจัดการเมือง การมีส่วนร่วมของประชาชน",
    plan: "บริหารจัดการดี",
    subProblem: [
      {
        no: 1,
        strategy: "ปรับปรุงการบริหารจัดการราชการอิเล็กทรอนิกส์",
      },
      {
        no: 2,
        strategy: "จัดตั้งสภาเมืองคนรุ่นใหม่",
      },
      {
        no: 3,
        strategy: "วางผังและพัฒนาเมืองอย่างมีคุณภาพ",
      },
      {
        no: 4,
        strategy: "สร้างการมีส่วนร่วมของประชาชน",
      },
      {
        no: 5,
        strategy: "ศูนย์ข้อมูล กทม. เพื่อประชาชน",
      },
    ],
  },
];
